<a href="https://colab.research.google.com/github/mikeamerenda/Project-2/blob/main/Project_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

First choice: Mall Customer Dataset
- 1. https://www.kaggle.com/shwetabh123/mall-customers?select=Mall_Customers.csv
- 2. This data shows the age, Gender, annual income, and spending scores for all customers who have visited the mall
- 3. The target is the gender
- 4. This is a classificaion problem
- 5. 4 features
- 6. 200 rows
- 7. possibility of not haveing enogh features to creat a fit model

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('/content/Mall_Customers.csv')
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
df.info

<bound method DataFrame.info of      CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]>

Second choice: Uber Pickups in NYC
- 1. https://www.kaggle.com/fivethirtyeight/uber-pickups-in-new-york-city?select=Uber-Jan-Feb-FOIL.csv
- 2. This data shows the Uber activity in NY based on trips, activity and base location
- 3. The target is the Date
- 4. This is a classificaion problem
- 5. 3 features
- 6. 353 rows
- 7. possibility of not haveing too many base numbers and variance in trips to create a an accurate model

In [11]:
df2 = pd.read_csv('/content/Uber-Jan-Feb-FOIL.csv')
df2.head()

  dispatching_base_number      date  active_vehicles  trips
0                  B02512  1/1/2015              190   1132
1                  B02765  1/1/2015              225   1765
2                  B02764  1/1/2015             3427  29421
3                  B02682  1/1/2015              945   7679
4                  B02617  1/1/2015             1228   9537

In [12]:
df2.info

<bound method DataFrame.info of     dispatching_base_number       date  active_vehicles  trips
0                    B02512   1/1/2015              190   1132
1                    B02765   1/1/2015              225   1765
2                    B02764   1/1/2015             3427  29421
3                    B02682   1/1/2015              945   7679
4                    B02617   1/1/2015             1228   9537
..                      ...        ...              ...    ...
349                  B02764  2/28/2015             3952  39812
350                  B02617  2/28/2015             1372  14022
351                  B02682  2/28/2015             1386  14472
352                  B02512  2/28/2015              230   1803
353                  B02765  2/28/2015              747   7753

[354 rows x 4 columns]>

In [13]:
df2['dispatching_base_number'].value_counts

<bound method IndexOpsMixin.value_counts of 0      B02512
1      B02765
2      B02764
3      B02682
4      B02617
        ...
349    B02764
350    B02617
351    B02682
352    B02512
353    B02765
Name: dispatching_base_number, Length: 354, dtype: object>